betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_rcc.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : ch32h417_rcc.h
* Author             : WCH
* Version            : V1.0.0
* Date               : 2025/03/01
* Description        : This file provides all the RCC firmware functions.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __CH32H417_RCC_H
#define __CH32H417_RCC_H

#ifdef __cplusplus
 extern "C" {
#endif

#include "ch32h417.h"

/* RCC_Exported_Types */
typedef struct
{
  uint32_t SYSCLK_Frequency;  /* returns SYSCLK clock frequency expressed in Hz */
  uint32_t HCLK_Frequency;    /* returns HCLK/Core0 clock frequency expressed in Hz */
  uint32_t Core_Frequency;   /* returns Core clock frequency expressed in Hz */
  uint32_t ADCCLK_Frequency;  /* returns ADCCLK clock frequency expressed in Hz */
}RCC_ClocksTypeDef;

/* HSE_configuration */
#define RCC_HSE_OFF                      ((uint32_t)0x00000000)
#define RCC_HSE_ON                       ((uint32_t)0x00010000)
#define RCC_HSE_Bypass                   ((uint32_t)0x00040000)

/* PLL_entry_clock_source */
#define RCC_PLLSource_HSI                ((uint32_t)0x00000000)
#define RCC_PLLSource_HSE                ((uint32_t)0x00000020)
#define RCC_PLLSource_USBHS              ((uint32_t)0x00000080)
#define RCC_PLLSource_ETH                ((uint32_t)0x000000A0)
#define RCC_PLLSource_USBSS              ((uint32_t)0x000000C0)
#define RCC_PLLSource_SERDES             ((uint32_t)0x000000E0)

/* PLL_multiplication_factor */
#define RCC_PLLMul_4                     ((uint32_t)0x00000000)
#define RCC_PLLMul_6                     ((uint32_t)0x00000001)
#define RCC_PLLMul_7                     ((uint32_t)0x00000002)
#define RCC_PLLMul_8                     ((uint32_t)0x00000003)
#define RCC_PLLMul_8_5                   ((uint32_t)0x00000004)
#define RCC_PLLMul_9                     ((uint32_t)0x00000005)
#define RCC_PLLMul_9_5                   ((uint32_t)0x00000006)
#define RCC_PLLMul_10                    ((uint32_t)0x00000007)
#define RCC_PLLMul_10_5                  ((uint32_t)0x00000008)
#define RCC_PLLMul_11                    ((uint32_t)0x00000009)
#define RCC_PLLMul_11_5                  ((uint32_t)0x0000000A)
#define RCC_PLLMul_12                    ((uint32_t)0x0000000B)
#define RCC_PLLMul_12_5                  ((uint32_t)0x0000000C)
#define RCC_PLLMul_13                    ((uint32_t)0x0000000D)
#define RCC_PLLMul_14                    ((uint32_t)0x0000000E)
#define RCC_PLLMul_15                    ((uint32_t)0x0000000F)
#define RCC_PLLMul_16                    ((uint32_t)0x00000010)
#define RCC_PLLMul_17                    ((uint32_t)0x00000011)
#define RCC_PLLMul_18                    ((uint32_t)0x00000012)
#define RCC_PLLMul_19                    ((uint32_t)0x00000013)
#define RCC_PLLMul_20                    ((uint32_t)0x00000014)
#define RCC_PLLMul_22                    ((uint32_t)0x00000015)
#define RCC_PLLMul_24                    ((uint32_t)0x00000016)
#define RCC_PLLMul_26                    ((uint32_t)0x00000017)
#define RCC_PLLMul_28                    ((uint32_t)0x00000018)
#define RCC_PLLMul_30                    ((uint32_t)0x00000019)
#define RCC_PLLMul_32                    ((uint32_t)0x0000001A)
#define RCC_PLLMul_34                    ((uint32_t)0x0000001B)
#define RCC_PLLMul_36                    ((uint32_t)0x0000001C)
#define RCC_PLLMul_38                    ((uint32_t)0x0000001D)
#define RCC_PLLMul_40                    ((uint32_t)0x0000001E)
#define RCC_PLLMul_59                    ((uint32_t)0x0000001F)

/* PLL_division_factor */
#define RCC_PLLDiv_1                     ((uint32_t)0x00000000)
#define RCC_PLLDiv_2                     ((uint32_t)0x00000001)
#define RCC_PLLDiv_3                     ((uint32_t)0x00000002)
#define RCC_PLLDiv_4                     ((uint32_t)0x00000003)
#define RCC_PLLDiv_5                     ((uint32_t)0x00000004)
#define RCC_PLLDiv_6                     ((uint32_t)0x00000005)
#define RCC_PLLDiv_7                     ((uint32_t)0x00000006)
#define RCC_PLLDiv_8                     ((uint32_t)0x00000007)
#define RCC_PLLDiv_9                     ((uint32_t)0x00000008)
#define RCC_PLLDiv_10                    ((uint32_t)0x00000009)
#define RCC_PLLDiv_11                    ((uint32_t)0x0000000A)
#define RCC_PLLDiv_12                    ((uint32_t)0x0000000B)
#define RCC_PLLDiv_13                    ((uint32_t)0x0000000C)
#define RCC_PLLDiv_14                    ((uint32_t)0x0000000D)
#define RCC_PLLDiv_15                    ((uint32_t)0x0000000E)
#define RCC_PLLDiv_16                    ((uint32_t)0x0000000F)
#define RCC_PLLDiv_17                    ((uint32_t)0x00000010)
#define RCC_PLLDiv_18                    ((uint32_t)0x00000011)
#define RCC_PLLDiv_19                    ((uint32_t)0x00000012)
#define RCC_PLLDiv_20                    ((uint32_t)0x00000013)
#define RCC_PLLDiv_21                    ((uint32_t)0x00000014)
#define RCC_PLLDiv_22                    ((uint32_t)0x00000015)
#define RCC_PLLDiv_23                    ((uint32_t)0x00000016)
#define RCC_PLLDiv_24                    ((uint32_t)0x00000017)
#define RCC_PLLDiv_25                    ((uint32_t)0x00000018)
#define RCC_PLLDiv_26                    ((uint32_t)0x00000019)
#define RCC_PLLDiv_27                    ((uint32_t)0x0000001A)
#define RCC_PLLDiv_28                    ((uint32_t)0x0000001B)
#define RCC_PLLDiv_29                    ((uint32_t)0x0000001C)
#define RCC_PLLDiv_30                    ((uint32_t)0x0000001D)
#define RCC_PLLDiv_31                    ((uint32_t)0x0000001E)
#define RCC_PLLDiv_32                    ((uint32_t)0x0000001F)
#define RCC_PLLDiv_33                    ((uint32_t)0x00000020)
#define RCC_PLLDiv_34                    ((uint32_t)0x00000021)
#define RCC_PLLDiv_35                    ((uint32_t)0x00000022)
#define RCC_PLLDiv_36                    ((uint32_t)0x00000023)
#define RCC_PLLDiv_37                    ((uint32_t)0x00000024)
#define RCC_PLLDiv_38                    ((uint32_t)0x00000025)
#define RCC_PLLDiv_39                    ((uint32_t)0x00000026)
#define RCC_PLLDiv_40                    ((uint32_t)0x00000027)
#define RCC_PLLDiv_41                    ((uint32_t)0x00000028)
#define RCC_PLLDiv_42                    ((uint32_t)0x00000029)
#define RCC_PLLDiv_43                    ((uint32_t)0x0000002A)
#define RCC_PLLDiv_44                    ((uint32_t)0x0000002B)
#define RCC_PLLDiv_45                    ((uint32_t)0x0000002C)
#define RCC_PLLDiv_46                    ((uint32_t)0x0000002D)
#define RCC_PLLDiv_47                    ((uint32_t)0x0000002E)
#define RCC_PLLDiv_48                    ((uint32_t)0x0000002F)
#define RCC_PLLDiv_49                    ((uint32_t)0x00000030)
#define RCC_PLLDiv_50                    ((uint32_t)0x00000031)
#define RCC_PLLDiv_51                    ((uint32_t)0x00000032)
#define RCC_PLLDiv_52                    ((uint32_t)0x00000033)
#define RCC_PLLDiv_53                    ((uint32_t)0x00000034)
#define RCC_PLLDiv_54                    ((uint32_t)0x00000035)
#define RCC_PLLDiv_55                    ((uint32_t)0x00000036)
#define RCC_PLLDiv_56                    ((uint32_t)0x00000037)
#define RCC_PLLDiv_57                    ((uint32_t)0x00000038)
#define RCC_PLLDiv_58                    ((uint32_t)0x00000039)
#define RCC_PLLDiv_59                    ((uint32_t)0x0000003A)
#define RCC_PLLDiv_60                    ((uint32_t)0x0000003B)
#define RCC_PLLDiv_61                    ((uint32_t)0x0000003C)
#define RCC_PLLDiv_62                    ((uint32_t)0x0000003D)
#define RCC_PLLDiv_63                    ((uint32_t)0x0000003E)
#define RCC_PLLDiv_64                    ((uint32_t)0x0000003F)

/* System_clock_source */
#define RCC_SYSCLKSource_HSI             ((uint32_t)0x00000000)
#define RCC_SYSCLKSource_HSE             ((uint32_t)0x00000001)
#define RCC_SYSCLKSource_PLLCLK          ((uint32_t)0x00000002)

/* Core1_division_factor */
#define RCC_SYSCLK_Div1                  ((uint32_t)0x00000000)
#define RCC_SYSCLK_Div2                  ((uint32_t)0x00000008)
#define RCC_SYSCLK_Div4                  ((uint32_t)0x00000009)
#define RCC_SYSCLK_Div8                  ((uint32_t)0x0000000A)
#define RCC_SYSCLK_Div16                 ((uint32_t)0x0000000B)
#define RCC_SYSCLK_Div64                 ((uint32_t)0x0000000C)
#define RCC_SYSCLK_Div128                ((uint32_t)0x0000000D)
#define RCC_SYSCLK_Div256                ((uint32_t)0x0000000E)
#define RCC_SYSCLK_Div512                ((uint32_t)0x0000000F)

/* HCLK_division_factor */
#define RCC_SYSCLKFPRE_Div1              ((uint32_t)0x00000000)
#define RCC_SYSCLKFPRE_Div2              ((uint32_t)0x00010000)
#define RCC_SYSCLKFPRE_Div4              ((uint32_t)0x00020000)

/* TIM_Clock_division_factor */
#define TIM_Clock_Div2                   ((uint32_t)0x00000005)
#define TIM_Clock_Div4                   ((uint32_t)0x00000006)
#define TIM_Clock_Div8                   ((uint32_t)0x00000007)

/* LPTIM_Clock_division_factor */
#define LPTIM_Clock_Div2                 ((uint32_t)0x00000005)
#define LPTIM_Clock_Div4                 ((uint32_t)0x00000006)
#define LPTIM_Clock_Div8                 ((uint32_t)0x00000007)

