betaflight/betaflight/lib/main/CH32H41x/Peripheral/inc/ch32h417_rcc.h
/* USBHSPLL_clock_source */
#define RCC_USBHSPLLSource_HSE           ((uint8_t)0x00)
#define RCC_USBHSPLLSource_HSI           ((uint8_t)0x01)
#define RCC_USBHSPLLSource_20METH        ((uint8_t)0x02)
#define RCC_USBHSPLLSource_PLL_CLK_DIV   ((uint8_t)0x03)

/* USBHS PLL Refer clock */
#define RCC_USBHSPLLRefer_25M            ((uint8_t)0x00)
#define RCC_USBHSPLLRefer_20M            ((uint8_t)0x01)
#define RCC_USBHSPLLRefer_24M            ((uint8_t)0x02)
#define RCC_USBHSPLLRefer_32M            ((uint8_t)0x03)

/* USBSS PLL Refer clock */
#define RCC_USBSSPLLRefer_20M            ((uint8_t)0x00)
#define RCC_USBSSPLLRefer_24M            ((uint8_t)0x10)
#define RCC_USBSSPLLRefer_25M            ((uint8_t)0x20)
#define RCC_USBSSPLLRefer_30M            ((uint8_t)0x30)
#define RCC_USBSSPLLRefer_32M            ((uint8_t)0x40)
#define RCC_USBSSPLLRefer_40M            ((uint8_t)0x50)
#define RCC_USBSSPLLRefer_60M            ((uint8_t)0x60)
#define RCC_USBSSPLLRefer_80M            ((uint8_t)0x70)

/* USBHS PLL Source clock Division*/
#define RCC_USBHSPLL_IN_Div1             ((uint32_t)0x0000)
#define RCC_USBHSPLL_IN_Div2             ((uint32_t)0x0100)
#define RCC_USBHSPLL_IN_Div3             ((uint32_t)0x0200)
#define RCC_USBHSPLL_IN_Div4             ((uint32_t)0x0300)
#define RCC_USBHSPLL_IN_Div5             ((uint32_t)0x0400)
#define RCC_USBHSPLL_IN_Div6             ((uint32_t)0x0500)
#define RCC_USBHSPLL_IN_Div7             ((uint32_t)0x0600)
#define RCC_USBHSPLL_IN_Div8             ((uint32_t)0x0700)
#define RCC_USBHSPLL_IN_Div9             ((uint32_t)0x0800)
#define RCC_USBHSPLL_IN_Div10            ((uint32_t)0x0900)
#define RCC_USBHSPLL_IN_Div11            ((uint32_t)0x0A00)
#define RCC_USBHSPLL_IN_Div12            ((uint32_t)0x0B00)
#define RCC_USBHSPLL_IN_Div13            ((uint32_t)0x0C00)
#define RCC_USBHSPLL_IN_Div14            ((uint32_t)0x0D00)
#define RCC_USBHSPLL_IN_Div15            ((uint32_t)0x0E00)
#define RCC_USBHSPLL_IN_Div16            ((uint32_t)0x0F00)
#define RCC_USBHSPLL_IN_Div17            ((uint32_t)0x1000)
#define RCC_USBHSPLL_IN_Div18            ((uint32_t)0x1100)
#define RCC_USBHSPLL_IN_Div19            ((uint32_t)0x1200)
#define RCC_USBHSPLL_IN_Div20            ((uint32_t)0x1300)
#define RCC_USBHSPLL_IN_Div21            ((uint32_t)0x1400)
#define RCC_USBHSPLL_IN_Div22            ((uint32_t)0x1500)
#define RCC_USBHSPLL_IN_Div23            ((uint32_t)0x1600)
#define RCC_USBHSPLL_IN_Div24            ((uint32_t)0x1700)
#define RCC_USBHSPLL_IN_Div25            ((uint32_t)0x1800)
#define RCC_USBHSPLL_IN_Div26            ((uint32_t)0x1900)
#define RCC_USBHSPLL_IN_Div27            ((uint32_t)0x1A00)
#define RCC_USBHSPLL_IN_Div28            ((uint32_t)0x1B00)
#define RCC_USBHSPLL_IN_Div29            ((uint32_t)0x1C00)
#define RCC_USBHSPLL_IN_Div30            ((uint32_t)0x1D00)
#define RCC_USBHSPLL_IN_Div31            ((uint32_t)0x1E00)
#define RCC_USBHSPLL_IN_Div32            ((uint32_t)0x1F00)

/* SERDES PLL clock Mul*/
#define RCC_SERDESPLLMul_25              ((uint32_t)0x0000)
#define RCC_SERDESPLLMul_28              ((uint32_t)0x0001)
#define RCC_SERDESPLLMul_30              ((uint32_t)0x0002)
#define RCC_SERDESPLLMul_32              ((uint32_t)0x0003)
#define RCC_SERDESPLLMul_35              ((uint32_t)0x0004)
#define RCC_SERDESPLLMul_38              ((uint32_t)0x0005)
#define RCC_SERDESPLLMul_40              ((uint32_t)0x0006)
#define RCC_SERDESPLLMul_45              ((uint32_t)0x0007)
#define RCC_SERDESPLLMul_50              ((uint32_t)0x0008)
#define RCC_SERDESPLLMul_56              ((uint32_t)0x0009)
#define RCC_SERDESPLLMul_60              ((uint32_t)0x000A)
#define RCC_SERDESPLLMul_64              ((uint32_t)0x000B)
#define RCC_SERDESPLLMul_70              ((uint32_t)0x000C)
#define RCC_SERDESPLLMul_76              ((uint32_t)0x000D)
#define RCC_SERDESPLLMul_80              ((uint32_t)0x000E)
#define RCC_SERDESPLLMul_90              ((uint32_t)0x000F)

/* ADC_clock_H_Level_Duty_Cycle */
#define RCC_ADC_H_Level_Mode0            ((uint32_t)0x00000000)
#define RCC_ADC_H_Level_Mode1            ((uint32_t)0x40000000)

/* ADC_clock_source */
#define RCC_ADCCLKSource_HCLK            ((uint8_t)0x00)
#define RCC_ADCCLKSource_USBHSPLL        ((uint8_t)0x01)

/* SYSPLL_clock_source */
#define RCC_SYSPLLClockSource_PLL        ((uint8_t)0x00)
#define RCC_SYSPLLClockSource_USBHSPLL   ((uint8_t)0x04)
#define RCC_SYSPLLClockSource_ETHPLL     ((uint8_t)0x05)
#define RCC_SYSPLLClockSource_SERDESPLL  ((uint8_t)0x06)
#define RCC_SYSPLLClockSource_USBSSPLL   ((uint8_t)0x07)

void RCC_DeInit(void);
void RCC_HSEConfig(uint32_t RCC_HSE);
ErrorStatus RCC_WaitForHSEStartUp(void);
void RCC_AdjustHSICalibrationValue(uint8_t HSICalibrationValue);
void RCC_HSICmd(FunctionalState NewState);
void RCC_PLLConfig(uint32_t RCC_PLLSource, uint32_t RCC_PLLDiv, uint32_t RCC_PLLMul);
void RCC_PLLCmd(FunctionalState NewState);
void RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSource);
uint8_t RCC_GetSYSCLKSource(void);
void RCC_HCLKSourceDivConfig(uint32_t RCC_SYSCLK, uint32_t RCC_SYSCLKFPRE);
void RCC_TIMClockSourDivConfig(TIM_TypeDef * Tim, uint32_t TIM_Clock_Divx);
void RCC_LPTIMClockSourDivConfig(uint32_t LPTIM_Clock_Divx);
void RCC_ITConfig(uint8_t RCC_IT, FunctionalState NewState);
void RCC_ADCUSBHSPLLCLKAsSourceConfig(uint32_t RCC_PPRE);
void RCC_ADCHCLKCLKAsSourceConfig(uint32_t RCC_PPRE2_DIV, uint32_t RCC_ADC_DIV);
void RCC_LSEConfig(uint8_t RCC_LSE);
void RCC_LSICmd(FunctionalState NewState);
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource);
void RCC_RTCCLKCmd(FunctionalState NewState);
void RCC_GetClocksFreq(RCC_ClocksTypeDef *RCC_Clocks);
void RCC_HBPeriphClockCmd(uint32_t RCC_HBPeriph, FunctionalState NewState);
void RCC_HB2PeriphClockCmd(uint32_t RCC_HB2Periph, FunctionalState NewState);
void RCC_HB1PeriphClockCmd(uint32_t RCC_HB1Periph, FunctionalState NewState);
void RCC_HBPeriphResetCmd(uint32_t RCC_HBPeriph, FunctionalState NewState);
void RCC_HB2PeriphResetCmd(uint32_t RCC_HB2Periph, FunctionalState NewState);
void RCC_HB1PeriphResetCmd(uint32_t RCC_HB1Periph, FunctionalState NewState);
void RCC_BackupResetCmd(FunctionalState NewState);
void RCC_ClockSecuritySystemCmd(uint8_t RCC_CSSHSEDIS, uint8_t RCC_CSSON_State);
void RCC_MCOConfig(uint8_t RCC_MCO);
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG);
void RCC_ClearFlag(void);
ITStatus RCC_GetITStatus(uint8_t RCC_IT);
void RCC_ClearITPendingBit(uint8_t RCC_IT);
void RCC_USBHS_PLLCmd(FunctionalState NewState);
void RCC_USBSS_PLLCmd(FunctionalState NewState);
void RCC_ETH_PLLCmd(FunctionalState NewState);
void RCC_SERDES_PLLCmd(FunctionalState NewState);
void RCC_PIPECmd(FunctionalState NewState);
void RCC_UTMIcmd(FunctionalState NewState);
void RCC_RGMIIcmd(FunctionalState NewState);
void RCC_ETH125MCLKConfig(uint32_t RCC_ETH125MMSource);
void RCC_HSADCCLKConfig(uint32_t RCC_HSADCSource);
void RCC_I2S3CLKConfig(uint32_t RCC_I2S3CLKSource);
void RCC_I2S2CLKConfig(uint32_t RCC_I2S2CLKSource);
void RCC_RNGCLKConfig(uint32_t RCC_RNGCLKSource);
void RCC_USBFSCLKConfig(uint32_t RCC_USBFSCLKSource);
void RCC_USBFS48ClockSourceDivConfig(uint32_t RCC_USBFS_DIV);
void RCC_LTDCCLKConfig(uint32_t RCC_LTDCClockSource);
void RCC_LTDCClockSourceDivConfig(uint32_t RCC_LTDCClockSource);
void RCC_UHSIFCLKConfig(uint32_t RCC_UHSIFClockSource);
void RCC_UHSIFClockSourceDivConfig(uint32_t RCC_UHSIFClockSource);
void RCC_USBHSPLLCLKConfig(uint32_t RCC_USBHSPLLSource);
void RCC_USBHSPLLReferConfig(uint32_t RCC_USBHSPLLRefer);
void RCC_USBSSPLLReferConfig(uint32_t RCC_USBSSPLLRefer);
void RCC_USBHSPLLClockSourceDivConfig(uint32_t RCC_USBHSPLL_IN_Div);
void RCC_SERDESPLLMulConfig(uint32_t RCC_SERDESPLLMul);
void RCC_ADCCLKDutyCycleConfig(uint32_t RCC_DutyCycle);
void RCC_ADCCLKConfig(uint32_t RCC_ADCCLKSource);
void RCC_SYSPLLGATEcmd(FunctionalState NewState);
void RCC_SYSPLLConfig(uint32_t RCC_SYSPLLClockSource);


 #ifdef __cplusplus
 }
 #endif

 #endif

